<?php

return [
    'fallback_locale' => 'cn',
    'locale' => 'cn',

    //安全验证
    'Vilidate' => [
        'required' => ':attribute 不得为空',
        'integer' => ':attribute 必须为数字',
        'alpha_num' => ':attribute 必须为字母、数字类型',
        'alpha_dash' => ':attribute 为字母、数字、破折号（-）或下划线（_）',
        'min' => ':attribute字符长度或数字大小不可小于:min',
        'max' => ':attribute字符长度或数字大小不可大于:max',
        'in' => ':attribute不正确',
        'json' => ':attribute 不是有效的 JSON 字符串',
        'mobile' => ':attribute请填写正确的手机号',
        'email' => ':attribute 请填写正确的邮件地址',
        'url' => ':attribute链接地址不合法',
        'regex' => ':attribute不合法',
    ],

    //状态码
    'StatusCode' => [
        200 => '成功',
        400 => '未知错误',
        401 => '无此权限',
        403 => '错误的请求方式',
        404 => '非法请求',
        500 => '服务器异常',

        ###用户信息
        1001 => '手机格式错误',
        1002 => '该用户不存在',
        1003 => '验证码格式错误',
        1004 => '验证码无效',

        #订单
        2001 => '订单不存在',
        2002 => '订单生成失败',

        ###订单状态
        2010 => '已付款',
        2011 => '待付款',
        2012 => '已完成',
        2013 => '已关闭',
        ###订单取消状态
        2014 => '未申请',
        2015 => '等待审核',
        2016 => '退款处理',
        2017 => '取消成功',
        2018 => '取消失败',
        2019 => '正在取消处理',
        ###订单支付类型
        2101 => '线上付款',
        2102 => '货到付款',
        2103 => '线下支付',
        ###订单发货
        2250 => '订单已发货',
        2251 => '发货失败，请稍候再试',

        #卡券
        3000 => '领券失败',
        3001 => '卡券不存在',
        3002 => '不可领取',
        3003 => '已领完',
        3004 => '不可再领',
        3005 => '尚未到领取时间',
        3006 => '领取时间已过',
        3007 => '已过期',
        3008 => '领券失败，请稍候再试',
        3009 => '领券成功,券已领完',
        3010 => '领券成功',
        3011 => '可领取',
        3012 => '再领一张',
        3013 => '已使用',
        3014 => '未使用',
        3015 => '已失效',
        3016 => '已不可使用',
        3017 => '卡券使用失败，请稍后再试',
        ###扫码员
        3150 => '抱歉，您没有权限扫码核销',
        3151 => '此卡券暂未到使用时间，不能核销',
        3152 => '此卡券已过期，不能核销',
        3153 => '此卡券已失效，不能核销',
        3154 => '此卡券已被使用过，不能重复核销',

        #提示信息
        4001 => '请求参数错误',
        4003 => '未能获取到信息',
        4004 => '请重新获取验证码',
        4005 => '验证码错误',

        #用户绑定
        4002 => '当前用户未绑定手机',
        4006 => '绑定手机失败',

        #商品
        ###商品标签
        5050 => '找不到指定品类',
        ###商品
        5150 => '找不到指定商品',

        #活动
        6046 => '已下线',
        6047 => '已中止',
        6048 => '已上线',
        6049 => '未上线',
        6050 => '不存在',
        6051 => '未开始',
        6052 => '已结束',
        6053 => '进行中',
        ###团购活动
        6150 => '马上团',
        6151 => '团光了',
        ###抢购活动
        6250 => '马上抢',
        6251 => '强光了',
        6252 => '已参与',
        6253 => '有机会',
    ],

    //more config...


];
